{
  "backend/main.mo": "Defines the backend canister's data types and state maps for clients, documents, trades, threads, profiles, and audit logs, including helpers for role checks and authorization mixins.",
  "backend/migration.mo": "Provides migration logic that adds a new tradeMap field to the actor state by transforming the old state into the new structure.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and requirement IDs for traceability.",
  "frontend-file-summaries.txt": "Contains prewritten descriptions summarizing the purpose of major frontend files including pages, hooks, components, and utilities.",
  "frontend/index.css": "Defines global Tailwind CSS layers and theming variables for light and dark modes, including color tokens and layout styles.",
  "frontend/index.html": "Static HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication gating, profile-setup flow, and renders the main dashboard layout with nested pages.",
  "frontend/src/auth/permissions.ts": "Defines capabilities per business role and helpers to check permissions and derive visible modules.",
  "frontend/src/auth/roles.ts": "Defines business roles and provides a function to validate and normalize an extended role string.",
  "frontend/src/components/admin/UserManagementPage.tsx": "Renders the user management UI gated by manage_users permission with an empty state placeholder.",
  "frontend/src/components/auth/PermissionGate.tsx": "Wraps children with permission checks, optionally disabling or hiding content based on capability.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Provides a profile creation dialog allowing users to enter personal info and select a role before saving.",
  "frontend/src/components/auth/SignInScreen.tsx": "Displays the Internet Identity sign‑in UI with error handling and notices.",
  "frontend/src/components/clients/ClientUpsertModal.tsx": "Modal for creating or editing client records with PAN validation and submission handling.",
  "frontend/src/components/common/BackendErrorBanner.tsx": "Shows an alert for backend errors, mapping auth-related messages to an Access Denied title.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable empty-state card with optional illustration, description, and action slot.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, initializing access control and invalidating dependent queries.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile using the actor and exposes loading and refetch helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity login, storing identity state and exposing login, logout, and status helpers.",
  "frontend/src/hooks/usePermissions.ts": "Computes the current user's business role and returns permission checks and allowed modules based on that role.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for fetching and mutating user profiles, clients, documents, and margin data.",
  "frontend/src/index.css": "Defines Tailwind layers and a slate-based color theme with utility classes for UI elements and status badges.",
  "frontend/src/layout/DashboardLayout.tsx": "Renders the main dashboard layout with a role‑based sidebar, user menu, and logout handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/audit/AuditTrailPage.tsx": "Displays searchable, exportable audit logs with permission-gated export and error/empty states.",
  "frontend/src/pages/clients/ClientManagementPage.tsx": "Provides client search, bulk upload sample, and modal-based client creation with permission checks.",
  "frontend/src/pages/compliance/RegulatoryCalendarPage.tsx": "Shows calendar and list views for regulatory deadlines with empty states and deadline creation gating.",
  "frontend/src/pages/config/ConfigurationHomePage.tsx": "Configuration hub linking to exchange settings, user management, and integrations, gated by permissions.",
  "frontend/src/pages/config/ExchangeSettingsPage.tsx": "Exchange configuration page with a back button and empty-state placeholder for connection settings.",
  "frontend/src/pages/config/IntegrationsPage.tsx": "Integration settings page with notice about no email support and an empty-state for external system configs.",
  "frontend/src/pages/data-entry/components/ManualTradeEntryPanel.tsx": "React form component for entering manual trades with validation, error handling, and an in-session trade list.",
  "frontend/src/pages/data-entry/tradeImport/manualTradeValidation.ts": "Defines manual trade entry types and validation logic for required fields, numeric checks, and allowed sides.",
  "frontend/src/pages/data-entry/tradeImport/tradeImportParsing.ts": "Parses CSV trade import files into row objects using FileReader and custom CSV parsing helpers.",
  "frontend/src/pages/data-entry/tradeImport/tradeImportValidation.ts": "Validates parsed CSV rows, checks required columns and field formats, and converts valid rows into Trade objects.",
  "frontend/src/pages/data-entry/TradeImportPage.tsx": "Handles trade file upload, parsing, validation, import, manual entry, and viewing trade history with permissions.",
  "frontend/src/pages/HowToUseGuidePage.tsx": "Displays a multi-section instructional guide explaining platform usage, roles, and features.",
  "frontend/src/pages/margin/MarginCollateralPage.tsx": "UI page showing margin and collateral metrics with tabs for snapshots, collateral, and reports.",
  "frontend/src/pages/OverviewPage.tsx": "Dashboard showing a how-to guide, key compliance metrics, alerts, and navigation actions.",
  "frontend/src/pages/reconciliation/BankReconciliationPage.tsx": "Bank reconciliation UI for uploading statements and viewing reconciliation runs with required CSV column info.",
  "frontend/src/pages/reports/ReportLibraryPage.tsx": "Report library page with search, navigation to scheduled reports and wizard, and an empty-state overview of templates.",
  "frontend/src/pages/reports/ReportWizardPage.tsx": "Starter page for the report generation wizard displaying template selection and guidance.",
  "frontend/src/pages/reports/ScheduledReportsPage.tsx": "Displays the Scheduled Reports page with navigation, permission-gated create buttons, and an empty state for automated report schedules.",
  "frontend/src/pages/surveillance/SurveillanceAlertsPage.tsx": "Shows surveillance alert statistics and tabbed alert categories, each with empty states for pending or absent alerts.",
  "frontend/src/utils/export.ts": "Provides functions to export data arrays to CSV or JSON by generating downloadable files in the browser.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL or session-based parameters, including hash routing support.",
  "frontend/src/validation/pan.ts": "Validates a PAN string against the standard alphanumeric format using a regex.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state describing tasks to fix trade file upload, parse/import workflows, and backend persistence for imported trades."
}