{
  "backend/main.mo": "Defines core actor data types for users, documents, financial records, compliance items, and various system entities used throughout the backend.",
  "feature_evidence.json": "Describes a feature requirement ensuring a specific user is always treated as a Super Admin, listing impacted files and components.",
  "frontend-file-summaries.txt": "Aggregates short summaries of numerous frontend files, describing their roles in routing, UI, hooks, permissions, and data handling.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes with custom color tokens.",
  "frontend/index.html": "Base HTML entry point that loads the React application via main.tsx and sets metadata and favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication gating, profile setup flow, and global layout with backend health checks.",
  "frontend/src/auth/permissions.ts": "Defines capabilities per business role and utilities to check permissions and determine visible modules.",
  "frontend/src/auth/roles.ts": "Defines business roles and provides a normalizer that maps extendedRole strings to valid roles.",
  "frontend/src/components/admin/UserManagementPage.tsx": "Renders a permission-gated user management page with navigation, user list placeholder, and invite button.",
  "frontend/src/components/auth/PermissionGate.tsx": "Generic wrapper that conditionally renders or disables children based on capability checks from usePermissions.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for collecting and saving user profile details including name, email, department, and role.",
  "frontend/src/components/auth/SignInScreen.tsx": "Sign‑in screen using Internet Identity with error display and fallback logo handling.",
  "frontend/src/components/bulk-upload/BulkUploadSection.tsx": "Bulk upload UI for selecting, parsing, validating, and importing files with sample download support.",
  "frontend/src/components/bulk-upload/bulkUploadTypes.ts": "Shared types defining bulk upload config, import summary, and parsed row exports.",
  "frontend/src/components/calendar/AddDeadlineDialog.tsx": "Dialog for creating regulatory deadlines with title, description, due date, and category fields.",
  "frontend/src/components/calendar/DeadlinesCalendarView.tsx": "Displays deadlines grouped by month with overdue highlighting and status/category badges.",
  "frontend/src/components/calendar/DeadlinesList.tsx": "Tabular list of deadlines with sorting, overdue marking, and ability to update submission status.",
  "frontend/src/components/clients/ClientsTable.tsx": "Displays a scrollable table of client records with basic details and document counts.",
  "frontend/src/components/clients/ClientUpsertModal.tsx": "Modal form for creating or editing a client with PAN validation and submission via useCreateClient.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary that catches fatal errors and displays a fallback screen with reload option.",
  "frontend/src/components/common/AppFatalErrorScreen.tsx": "Full‑page error screen showing error info, troubleshooting steps, and a reload button.",
  "frontend/src/components/common/BackendErrorBanner.tsx": "Banner for displaying backend errors, with special handling for authorization issues.",
  "frontend/src/components/common/BackendHealthBanner.tsx": "Alert banner shown when backend is unreachable, offering a retry button.",
  "frontend/src/components/common/EmptyState.tsx": "Generic empty‑state component with optional illustration and action slot.",
  "frontend/src/components/margin/CollateralTable.tsx": "Renders collateral records in a table, including security details and timestamps.",
  "frontend/src/components/reconciliation/ReconciliationRunsList.tsx": "Lists reconciliation runs sorted by upload date with status and a view‑details action.",
  "frontend/src/components/reconciliation/StatementRowsDialog.tsx": "Dialog that displays up to 100 statement rows for a reconciliation run with date and amounts.",
  "frontend/src/components/reports/ReportTemplatesList.tsx": "Grid of report templates with category badges and a button to select a template.",
  "frontend/src/features/bulk-upload/clientBulkUpload.ts": "Validates parsed client upload rows and converts them into BulkClient objects, collecting row-level errors.",
  "frontend/src/features/bulk-upload/collateralBulkUpload.ts": "Validates collateral upload rows, converts them into CollateralRecord objects, and returns results with errors.",
  "frontend/src/features/bulk-upload/marginSnapshotsBulkUpload.ts": "Validates margin snapshot rows and converts them into MarginSnapshot objects with error tracking.",
  "frontend/src/features/bulk-upload/reconciliationBulkUpload.ts": "Validates reconciliation statement rows and converts them into StatementRow objects with error reporting.",
  "frontend/src/features/reports/reportTemplates.ts": "Defines report data requirements and maps backend data into formatted report rows for different template types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs periodic backend health checks using the current actor and exposes health status.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and exposes the current user's profile using the authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and auth client setup.",
  "frontend/src/hooks/usePermissions.ts": "Derives user role from profile and exposes permission checks and visible modules based on capabilities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user, client, document, and dashboard-related backend data using an actor instance.",
  "frontend/src/index.css": "Sets up Tailwind layers and a custom slate-themed color system with utility classes and dense table styling.",
  "frontend/src/layout/DashboardLayout.tsx": "Provides the main dashboard layout with sidebar navigation, user menu, profile refresh, and logout handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/audit/AuditTrailPage.tsx": "Displays audit log entries with search, export permission control, error handling, and a table view.",
  "frontend/src/pages/clients/ClientManagementPage.tsx": "Provides client search, CRUD modal, bulk upload handling, and tabbed navigation for client data and upload actions.",
  "frontend/src/pages/compliance/RegulatoryCalendarPage.tsx": "Shows regulatory deadlines in list or calendar views with add-deadline controls and permission gating.",
  "frontend/src/pages/config/ConfigurationHomePage.tsx": "Home page for configuration modules linking to exchange settings, user management, and integrations, gated by permissions.",
  "frontend/src/pages/config/ExchangeSettingsPage.tsx": "Displays exchange configuration placeholder content with navigation back and permission restriction.",
  "frontend/src/pages/config/IntegrationsPage.tsx": "Shows integration settings with a notice about unavailable email integrations and a placeholder config section.",
  "frontend/src/pages/data-entry/components/ManualTradeEntryPanel.tsx": "React form for entering manual trades with validation, session-stored trade list, and removal support.",
  "frontend/src/pages/data-entry/tradeImport/manualTradeValidation.ts": "Defines manual trade entry types and validation logic, including required fields and numeric checks.",
  "frontend/src/pages/data-entry/tradeImport/tradeImportParsing.ts": "Parses CSV trade import files using a shared parser and returns structured row data or errors.",
  "frontend/src/pages/data-entry/tradeImport/tradeImportValidation.ts": "Validates parsed CSV trade rows and converts them into Trade objects, enforcing required fields and value rules.",
  "frontend/src/pages/data-entry/TradeImportPage.tsx": "Handles trade CSV upload, parsing, validation, import workflow, manual entry option, and trade history display.",
  "frontend/src/pages/HowToUseGuidePage.tsx": "Renders a detailed instructional guide explaining platform features, roles, and onboarding steps.",
  "frontend/src/pages/margin/MarginCollateralPage.tsx": "Page for uploading and viewing margin snapshots and collateral data with validation and permissions.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a styled 404 page with a button redirecting users back to the dashboard.",
  "frontend/src/pages/OverviewPage.tsx": "Shows dashboard metrics, a link to the usage guide, and key compliance statistics using permission-aware UI.",
  "frontend/src/pages/reconciliation/BankReconciliationPage.tsx": "Bank reconciliation page handling statement uploads, validation, run history, and viewing statement rows.",
  "frontend/src/pages/reports/ReportLibraryPage.tsx": "Report library UI enabling search, browsing templates, and navigating to report generation features.",
  "frontend/src/pages/reports/ReportWizardPage.tsx": "Implements a wizard UI for selecting a report template, validating required data, generating a report, and exporting it as CSV.",
  "frontend/src/pages/reports/ScheduledReportsPage.tsx": "Displays scheduled report automation UI with an empty state and option to create new schedules based on permissions.",
  "frontend/src/pages/surveillance/SurveillanceAlertsPage.tsx": "Shows surveillance alert statistics and tabbed views with empty states for various alert categories.",
  "frontend/src/utils/backendError.ts": "Normalizes backend errors into user-friendly messages and logs technical details, including schema error detection.",
  "frontend/src/utils/bulkUploadFileParsing.ts": "Provides CSV file parsing utilities, including header extraction, row parsing, and basic format validation with fallback errors.",
  "frontend/src/utils/bulkUploadValidation.ts": "Contains generic validation helpers for bulk upload rows, including required columns, number checks, and date validation.",
  "frontend/src/utils/export.ts": "Exports data to CSV or JSON files by generating downloadable blobs in the browser.",
  "frontend/src/utils/sampleDownloads.ts": "Safely downloads sample CSV files and guards against accidental HTML fallback responses.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/src/validation/pan.ts": "Defines a regex for validating PAN numbers and exports a function that tests input strings against it.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, and custom themes including colors, fonts, animations, and container settings.",
  "project_state.json": "Stores project metadata, known issues, and admin‑rights feature requests for the project state."
}