{
  "backend/main.mo": "Defines core data models for users, documents, margin, collateral, trades, deadlines, and audit structures within the backend actor.",
  "feature_evidence.json": "Lists feature evidence records linking features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their functionality and purpose.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and base styling rules.",
  "frontend/index.html": "HTML entry file that loads the React application and initializes the root container.",
  "frontend/src/App.tsx": "Main React app routing, auth gating, and layout structure using TanStack Router and profile setup logic.",
  "frontend/src/auth/permissions.ts": "Defines capability-based permission mappings for all business roles and utilities for permission checks.",
  "frontend/src/auth/roles.ts": "Defines valid business roles and normalizes extended role strings to these role types.",
  "frontend/src/components/admin/UserManagementPage.tsx": "User management page gated by manage_users capability, showing navigation, basic layout, and an empty state.",
  "frontend/src/components/auth/PermissionGate.tsx": "Renders children only if the user has a required capability, optionally disabling instead of hiding.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A dialog for collecting and submitting user profile details such as name, email, department, and role.",
  "frontend/src/components/auth/SignInScreen.tsx": "Displays a sign-in card using Internet Identity with status handling and basic error messaging.",
  "frontend/src/components/bulk-upload/BulkUploadSection.tsx": "Handles file selection, parsing, validation, sample download, and import workflow for bulk uploads.",
  "frontend/src/components/bulk-upload/bulkUploadTypes.ts": "Defines shared types for bulk upload, including config and import summary structures.",
  "frontend/src/components/calendar/AddDeadlineDialog.tsx": "Dialog for creating a new regulatory deadline with title, description, date, and category.",
  "frontend/src/components/calendar/DeadlinesCalendarView.tsx": "Groups deadlines by month and displays them in a calendar-style list with status and overdue indicators.",
  "frontend/src/components/calendar/DeadlinesList.tsx": "Displays deadlines in a sortable table with status indicators and an action to mark items submitted.",
  "frontend/src/components/clients/ClientsTable.tsx": "Displays a scrollable table of clients showing name, PAN, address, document count, and creation date.",
  "frontend/src/components/clients/ClientUpsertModal.tsx": "Modal form for creating or editing a client with PAN validation and submission via useCreateClient.",
  "frontend/src/components/common/BackendErrorBanner.tsx": "Renders an error banner with special handling for authentication or permission errors.",
  "frontend/src/components/common/EmptyState.tsx": "Shows an empty-state card with optional illustration, description, and action slot.",
  "frontend/src/components/margin/CollateralTable.tsx": "Displays collateral records in a table with client ID, security details, quantities, and dates.",
  "frontend/src/components/reconciliation/ReconciliationRunsList.tsx": "Lists reconciliation runs sorted by upload date with status, metadata, and a view-details action.",
  "frontend/src/components/reconciliation/StatementRowsDialog.tsx": "Dialog showing up to 100 statement rows for a reconciliation run with amounts and balances.",
  "frontend/src/components/reports/ReportTemplatesList.tsx": "Grid of report templates with metadata and a button to select a template.",
  "frontend/src/features/bulk-upload/clientBulkUpload.ts": "Validates and converts CSV client rows into BulkClient objects, checking required fields and PAN format.",
  "frontend/src/features/bulk-upload/collateralBulkUpload.ts": "Validates and converts collateral upload rows into CollateralRecord objects with numeric and date checks.",
  "frontend/src/features/bulk-upload/marginSnapshotsBulkUpload.ts": "Validates parsed margin snapshot rows and converts them to MarginSnapshot objects, collecting row-level errors. Exposes required columns and a bulk validation/conversion function.",
  "frontend/src/features/bulk-upload/reconciliationBulkUpload.ts": "Validates parsed statement rows and converts them to StatementRow objects with error aggregation. Defines required columns and a bulk import handler.",
  "frontend/src/features/reports/reportTemplates.ts": "Maps report template IDs to required data sources and transforms backend entities into row-level report data. Supports client, trade, margin, compliance, and reconciliation report types.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on identity change. Handles admin token initialization and actor lifecycle.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile using the actor and exposes loading and refetch helpers. Depends on actor readiness.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides login, logout, and identity management via Internet Identity, restoring identity on load and exposing status flags. Wraps AuthClient creation and context handling.",
  "frontend/src/hooks/usePermissions.ts": "Computes the user's business role and exposes capability checks and visible modules. Uses current user profile to derive permissions.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on clients, documents, trades, snapshots, deadlines, reports, and user profiles. Integrates actor-based backend calls with cache invalidation.",
  "frontend/src/index.css": "Tailwind-based theme defining light/dark palettes, status colors, and utility styles for tables and badges. Applies global variables and typography for financial UI.",
  "frontend/src/layout/DashboardLayout.tsx": "Defines the main dashboard layout with sidebar navigation, user menu, and permission-based visible modules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/audit/AuditTrailPage.tsx": "Shows searchable, exportable audit logs with permissions and backend error handling.",
  "frontend/src/pages/clients/ClientManagementPage.tsx": "Manages client records with search, CRUD modals, tabs, and CSV bulk upload processing.",
  "frontend/src/pages/compliance/RegulatoryCalendarPage.tsx": "Page showing regulatory deadlines with list and calendar views, supporting add-dialog and permission checks.",
  "frontend/src/pages/config/ConfigurationHomePage.tsx": "Configuration landing page displaying navigation cards for exchanges, users, and integrations, gated by permissions.",
  "frontend/src/pages/config/ExchangeSettingsPage.tsx": "Exchange settings page with a placeholder empty state and navigation back to the config home, permission-protected.",
  "frontend/src/pages/config/IntegrationsPage.tsx": "Integrations settings page showing a notice and an empty-state card for configuring external systems, behind permission control.",
  "frontend/src/pages/data-entry/components/ManualTradeEntryPanel.tsx": "Manual trade entry form that validates input, displays errors, and stores entered trades locally for review.",
  "frontend/src/pages/data-entry/tradeImport/manualTradeValidation.ts": "Validation utilities defining trade entry types and rules for checking required fields, formats, and allowed values.",
  "frontend/src/pages/data-entry/tradeImport/tradeImportParsing.ts": "CSV parsing helper that validates file type and uses a shared parser to convert trade files into row objects.",
  "frontend/src/pages/data-entry/tradeImport/tradeImportValidation.ts": "Validates parsed trade rows, checks required fields, converts rows to Trade objects, and returns errors if validation fails.",
  "frontend/src/pages/data-entry/TradeImportPage.tsx": "Trade import workflow supporting CSV upload, validation, import, sample download, and history viewing with permission checks.",
  "frontend/src/pages/HowToUseGuidePage.tsx": "Renders a scrollable help guide explaining platform usage, roles, and onboarding steps.",
  "frontend/src/pages/margin/MarginCollateralPage.tsx": "Page for uploading and viewing margin snapshots and collateral records with validation, permissions, and tabbed UI.",
  "frontend/src/pages/OverviewPage.tsx": "Displays dashboard metrics, a quick-start guide link, and permission-aware key statistics.",
  "frontend/src/pages/reconciliation/BankReconciliationPage.tsx": "Handles bank statement bulk upload, displays reconciliation runs, and allows viewing statement rows with permissions.",
  "frontend/src/pages/reports/ReportLibraryPage.tsx": "Displays searchable list of report templates with navigation to generation or scheduling functions.",
  "frontend/src/pages/reports/ReportWizardPage.tsx": "Guides users through selecting a report template, validating necessary data, and generating downloadable reports.",
  "frontend/src/pages/reports/ScheduledReportsPage.tsx": "Shows scheduled report configurations and provides actions to create new automated report schedules.",
  "frontend/src/pages/surveillance/SurveillanceAlertsPage.tsx": "Renders the surveillance alerts dashboard with summary cards and tabbed empty states for different alert categories.",
  "frontend/src/utils/backendError.ts": "Normalizes backend errors into user-friendly messages and logs technical details, with special handling for schema-related errors.",
  "frontend/src/utils/bulkUploadFileParsing.ts": "Parses CSV files into row objects with header mapping and basic validation, and rejects unsupported file types.",
  "frontend/src/utils/bulkUploadValidation.ts": "Provides reusable validators for required columns, empty fields, numbers, patterns, and dates in bulk-uploaded CSV rows.",
  "frontend/src/utils/export.ts": "Exports arrays or objects to downloadable CSV or JSON files using Blob-based downloads.",
  "frontend/src/utils/sampleDownloads.ts": "Safely downloads sample CSV files and blocks accidental HTML fallback responses before triggering a file download.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/validation/pan.ts": "Validates PAN numbers using a predefined regex pattern.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata listing issues and existing features for margin upload visibility and DOM ID collision fixes."
}