{
  "backend/main.mo": "Defines types and maps for clients, documents, user profiles, threads, patterns, and financial records, with role-based helpers and integrated storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of each major frontend file and page.",
  "frontend/index.css": "Tailwind CSS base configuration defining light/dark theme color variables and global styles.",
  "frontend/index.html": "HTML entry point loading the React app and linking the favicon.",
  "frontend/src/App.tsx": "Main routing and authentication flow setup including profile gating, dashboard layout, and module routes.",
  "frontend/src/auth/permissions.ts": "Defines capability sets for each business role and utilities for checking permissions and visible modules.",
  "frontend/src/auth/roles.ts": "Declares business role types and a normalizer mapping extended role strings to valid roles.",
  "frontend/src/components/admin/UserManagementPage.tsx": "User management page gated by permissions with basic layout and an empty state for user administration.",
  "frontend/src/components/auth/PermissionGate.tsx": "Checks user capability and conditionally renders or disables children based on permissions.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a profile setup form and saves user details using a mutation hook.",
  "frontend/src/components/auth/SignInScreen.tsx": "Renders an Internet Identity login screen with status handling and error alerts.",
  "frontend/src/components/clients/ClientUpsertModal.tsx": "Modal for creating or editing a client with PAN validation and client mutation calls.",
  "frontend/src/components/common/BackendErrorBanner.tsx": "Shows an alert banner for backend errors, highlighting authentication-related issues.",
  "frontend/src/components/common/EmptyState.tsx": "Displays an empty state card with optional illustration, text, and action content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile using the actor and exposes loading state and refetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and status.",
  "frontend/src/hooks/usePermissions.ts": "Computes the user’s role and capabilities from their profile and exposes permission helpers.",
  "frontend/src/hooks/useQueries.ts": "Collection of query and mutation hooks for profiles, clients, documents, and margin snapshots using the backend actor.",
  "frontend/src/index.css": "Tailwind config with custom color variables, dark mode values, and utility classes for badges, tables, and monospace font.",
  "frontend/src/layout/DashboardLayout.tsx": "Main dashboard layout providing sidebar navigation, user menu, and role-based visible modules.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/pages/audit/AuditTrailPage.tsx": "Audit log viewer with search, export (permission‑gated), and a table of immutable system events.",
  "frontend/src/pages/clients/ClientManagementPage.tsx": "Client management interface with search, bulk upload sample, empty state message, and client creation modal.",
  "frontend/src/pages/compliance/RegulatoryCalendarPage.tsx": "Provides a calendar and list view for regulatory deadlines with permission‑gated actions and empty states.",
  "frontend/src/pages/config/ConfigurationHomePage.tsx": "Displays configuration categories like exchanges, users, and integrations, gated by manage_config permissions.",
  "frontend/src/pages/config/ExchangeSettingsPage.tsx": "Shows exchange configuration settings with a back button and an empty state for connected exchanges.",
  "frontend/src/pages/config/IntegrationsPage.tsx": "Lists external integrations with an alert note and an empty state for configuring KRA, depositories, and accounting systems.",
  "frontend/src/pages/data-entry/TradeImportPage.tsx": "Supports trade import via file upload, manual entry, and history, with permission‑controlled tabs and sample download.",
  "frontend/src/pages/HowToUseGuidePage.tsx": "Scrollable guide page explaining platform onboarding, roles, permissions, and module usage.",
  "frontend/src/pages/margin/MarginCollateralPage.tsx": "Displays margin metrics, snapshot data, and collateral tabs with dynamic loading and empty states.",
  "frontend/src/pages/OverviewPage.tsx": "Dashboard overview showing key metrics, quick actions, alerts, and link to the how‑to guide.",
  "frontend/src/pages/reconciliation/BankReconciliationPage.tsx": "Allows bank statement uploads, shows reconciliation runs, and includes sample download and required columns info.",
  "frontend/src/pages/reports/ReportLibraryPage.tsx": "Provides searchable report templates, scheduled reports navigation, and report generation actions based on permissions.",
  "frontend/src/pages/reports/ReportWizardPage.tsx": "Shows a simple report generation wizard entry screen with template selection placeholder.",
  "frontend/src/pages/reports/ScheduledReportsPage.tsx": "Renders the Scheduled Reports page with navigation, permission-gated actions, and an empty state for automated report schedules.",
  "frontend/src/pages/surveillance/SurveillanceAlertsPage.tsx": "Displays surveillance alert metrics and tabbed alert categories, each showing empty states when no alerts exist.",
  "frontend/src/utils/export.ts": "Provides CSV and JSON export utilities that generate downloadable files from supplied data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, with support for hash-based routing.",
  "frontend/src/validation/pan.ts": "Validates PAN numbers using a simple regex pattern.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Describes the project’s current state, goals, architecture notes, and implemented features for a compliance-focused dashboard."
}