{
  "backend/main.mo": "Defines backend actor with user roles, profiles, document metadata, KYC records, margin snapshots, interest records, audit logs, threads, and behavior patterns along with access control and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files used across the app.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and global base styles.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures authentication flow, profile setup gating, and TanStack Router routes for all major pages.",
  "frontend/src/auth/permissions.ts": "Defines capabilities per business role and utilities to check permissions and visible modules.",
  "frontend/src/auth/roles.ts": "Defines business role types and a normalization function mapping extended roles to valid roles.",
  "frontend/src/components/admin/UserManagementPage.tsx": "User management UI that requires manage_users capability and shows an empty state for system users.",
  "frontend/src/components/auth/PermissionGate.tsx": "Wraps children with access control logic, optionally disabling or hiding content based on a capability check.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating a user profile with fields for name, email, department, and role, submitting via a saveProfile mutation.",
  "frontend/src/components/auth/SignInScreen.tsx": "Login screen using Internet Identity with status handling and error alerts.",
  "frontend/src/components/clients/ClientUpsertModal.tsx": "Modal for creating or editing a client with PAN validation and submission via createClient.",
  "frontend/src/components/common/BackendErrorBanner.tsx": "Displays an error banner, labeling authorization-related errors as access denied.",
  "frontend/src/components/common/EmptyState.tsx": "Shows an empty-state card with optional illustration, description, and actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and exposes the current user's profile using the active actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and login logic via Internet Identity, managing identity loading and errors.",
  "frontend/src/hooks/usePermissions.ts": "Derives user capabilities and visible modules from the current user’s role.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and mutate user profiles, clients, documents, margin snapshots, and audit entries via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and a slate-themed light/dark color palette along with utility classes for tables, badges, and UI elements.",
  "frontend/src/layout/DashboardLayout.tsx": "Renders the main dashboard layout with sidebar navigation, user menu, and role-based visible modules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/audit/AuditTrailPage.tsx": "Displays searchable audit logs fetched from the backend with export capability gated by permissions.",
  "frontend/src/pages/clients/ClientManagementPage.tsx": "Provides a client management UI with search, sample download, empty state, and a modal for creating clients.",
  "frontend/src/pages/compliance/RegulatoryCalendarPage.tsx": "Displays regulatory deadlines with calendar and list views, showing empty states and allowing creation of deadlines with permissions.",
  "frontend/src/pages/config/ConfigurationHomePage.tsx": "Shows configuration sections for exchanges, users, and integrations, gated by manage_config permissions.",
  "frontend/src/pages/config/ExchangeSettingsPage.tsx": "Presents exchange configuration info with an empty state and back navigation, restricted to manage_config users.",
  "frontend/src/pages/config/IntegrationsPage.tsx": "Shows integration configuration options with a warning about email limitations and an empty state, gated by manage_config.",
  "frontend/src/pages/data-entry/components/ManualTradeEntryPanel.tsx": "Manages manual trade entry with validation, form handling, trade list management, and session-stored trades.",
  "frontend/src/pages/data-entry/tradeImport/manualTradeValidation.ts": "Defines manual trade entry types and validation logic, including required fields, numeric checks, and helpers.",
  "frontend/src/pages/data-entry/TradeImportPage.tsx": "Provides trade import via file upload, manual entry panel, and import history, restricted by create_trades capability.",
  "frontend/src/pages/HowToUseGuidePage.tsx": "Displays a scrollable onboarding and usage guide covering roles, permissions, and platform features.",
  "frontend/src/pages/margin/MarginCollateralPage.tsx": "Renders margin and collateral overview with stats, snapshot tabs, and snapshot loading/empty states using fetched data.",
  "frontend/src/pages/OverviewPage.tsx": "Shows the main dashboard overview with key compliance metrics, alerts, and a link to the user guide.",
  "frontend/src/pages/reconciliation/BankReconciliationPage.tsx": "Displays bank reconciliation UI with sample download, statement upload, and empty-state for reconciliation runs.",
  "frontend/src/pages/reports/ReportLibraryPage.tsx": "Provides a searchable report library with navigation to scheduled reports and report generation wizard, showing an empty-state template list.",
  "frontend/src/pages/reports/ReportWizardPage.tsx": "Shows the initial report generation wizard screen with template selection placeholder and navigation back to the library.",
  "frontend/src/pages/reports/ScheduledReportsPage.tsx": "Displays scheduled report automation overview with option to create schedules and an empty-state when none exist.",
  "frontend/src/pages/surveillance/SurveillanceAlertsPage.tsx": "Shows surveillance alert statistics and categorized alert tabs, each with empty states for alert queues.",
  "frontend/src/utils/export.ts": "Provides CSV and JSON export utilities that serialize data, generate blobs, and trigger browser downloads.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/validation/pan.ts": "Validates Indian PAN numbers using a fixed regex pattern.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, OKLCH color variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining schema version, existing features, pending feature requests, and metadata for the manual trade entry preparation project."
}