{
  "kind": "build_request",
  "title": "Prepare Trade Import page for manual trade entry",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the current Manual Entry tab empty state on the Trade Import page with a functional manual trade entry UI that allows users to input a single trade using the same fields listed in the Upload tab’s “Required columns” hint: client_code, trade_date, exchange, segment, security, side, quantity, price, order_id, trade_id.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In Trade import, prepare the page for manual entry"
        ]
      },
      "acceptanceCriteria": [
        "On `frontend/src/pages/data-entry/TradeImportPage.tsx`, the Manual Entry tab renders a form (not an EmptyState) with labeled inputs for: client_code, trade_date, exchange, segment, security, side, quantity, price, order_id, trade_id.",
        "All user-facing labels, helper text, and button text in the manual entry UI are in English.",
        "The Manual Entry form layout is responsive and consistent with existing UI patterns (Card, form spacing, Tailwind utilities, shadcn components)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add client-side validation and clear error messaging for the manual trade entry form to prevent incomplete/invalid entries before the user can add/save the trade.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In Trade import, prepare the page for manual entry"
        ]
      },
      "acceptanceCriteria": [
        "Attempting to submit/add a manual trade with missing required fields shows inline validation errors and does not proceed.",
        "Numeric fields (quantity, price) validate as positive numbers and show an inline error when invalid.",
        "trade_date validates as a date input and shows an inline error when invalid or missing.",
        "side validates against an explicit allowed set (e.g., Buy/Sell) and shows an inline error when not selected."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a “prepared for entry” workflow for the Manual Entry tab by letting users add the validated trade to an in-page list (session-only) and manage that list (view rows and remove an entry).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In Trade import, prepare the page for manual entry"
        ]
      },
      "acceptanceCriteria": [
        "After a successful form submission, the entered trade is added to a list/table shown within the Manual Entry tab and the form is reset to blank/defaults.",
        "The in-page list/table displays at least the same fields collected by the form.",
        "Each listed trade entry can be removed from the list via a delete/remove action.",
        "The list/table state is session-only (no backend persistence required for this change)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a clear, non-blocking UI note in the Manual Entry tab indicating that manual trade entry is currently prepared in the UI and not yet connected to backend persistence (if backend persistence is not implemented as part of this change).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In Trade import, prepare the page for manual entry"
        ]
      },
      "acceptanceCriteria": [
        "The Manual Entry tab includes a concise informational note (English) describing the current behavior (e.g., entries are kept in-page for now).",
        "The note is visually styled as an informational callout/alert consistent with the app’s design system.",
        "The note does not block form usage and does not appear on other tabs."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (read-only UI component sources must be composed, not edited).",
    "Do not modify immutable hook entry points listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "Keep changes focused to preparing the Trade Import manual entry experience; do not introduce unrelated modules or flows."
  ],
  "nonGoals": [
    "Implementing backend storage, querying, or audit logging for trades.",
    "Implementing actual file upload parsing/import processing.",
    "Implementing real import history backed by persisted records."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}