{
  "kind": "build_request",
  "title": "Fix Margin upload button visibility on Margin & Collateral page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Margin & Collateral page, ensure users who can view the page but lack the \"manage_margin\" capability can still see the margin upload section area, with a clear in-place message explaining they do not have permission to upload and must contact an admin to enable uploads.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Cant see margin upload button"
        ]
      },
      "acceptanceCriteria": [
        "When signed in as a role without \"manage_margin\" (e.g., Dealer), the Margin Snapshots tab still displays an upload card area instead of rendering nothing.",
        "The upload controls (Choose File / Import) are disabled or not actionable for users lacking \"manage_margin\".",
        "A visible English message is shown (in the page content, not only via toast) indicating the user does not have permission to upload margin/collateral data."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove DOM id collisions in BulkUploadSection so that multiple instances on the same page (Margin Snapshots and Pledged Securities) do not share the same file input id, ensuring the \"Choose File\" control reliably opens the correct file picker.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Cant see margin upload button"
        ]
      },
      "acceptanceCriteria": [
        "Each BulkUploadSection instance uses a unique file input id (not a hard-coded shared id).",
        "Clicking \"Choose File\" in the Margin Snapshots tab opens the file picker and selecting a file updates the UI with the selected filename.",
        "Clicking \"Choose File\" in the Pledged Securities tab opens the file picker and selecting a file updates the UI with the selected filename."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Changing role/capability assignments for business roles (e.g., granting manage_margin to additional roles).",
    "Adding new backend endpoints or altering backend schemas."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}