{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Margin & Collateral upload visibility + BulkUploadSection id collisions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show the margin upload card area to users without manage_margin, with a clear in-place permission message and non-actionable controls.",
      "acceptanceCriteria": [
        "When signed in as a role without \"manage_margin\" (e.g., Dealer), the Margin Snapshots tab still displays an upload card area instead of rendering nothing.",
        "The upload controls (Choose File / Import) are disabled or not actionable for users lacking \"manage_margin\".",
        "A visible English message is shown (in the page content, not only via toast) indicating the user does not have permission to upload margin/collateral data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/margin/MarginCollateralPage.tsx",
          "operation": "modify",
          "description": "Remove the current PermissionGate wrapper that hides the upload area entirely. Instead, use the authorization component’s frontend capability checks (usePermissions / manage_margin) to always render the BulkUploadSection card, but pass disabled=true when the user lacks manage_margin. Render an in-place, on-page English message (e.g., an alert/banner above the upload controls) explaining they do not have permission to upload margin/collateral data and must contact an admin to enable uploads. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/bulk-upload/BulkUploadSection.tsx",
          "operation": "modify",
          "description": "Harden the disabled state so users lacking manage_margin cannot accidentally trigger file selection or import via label/input interactions. Ensure disabled=true makes Choose File and Import non-actionable (including preventing the label from opening the hidden file input). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure each BulkUploadSection instance uses a unique file input id and reliably resets/targets its own file picker.",
      "acceptanceCriteria": [
        "Each BulkUploadSection instance uses a unique file input id (not a hard-coded shared id).",
        "Clicking \"Choose File\" in the Margin Snapshots tab opens the file picker and selecting a file updates the UI with the selected filename.",
        "Clicking \"Choose File\" in the Pledged Securities tab opens the file picker and selecting a file updates the UI with the selected filename."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/bulk-upload/BulkUploadSection.tsx",
          "operation": "modify",
          "description": "Replace the hard-coded file input id ('bulk-upload-file-input') with a per-instance unique id (e.g., via React useId or an instance-stable generated id) and update the label htmlFor accordingly. Remove document.getElementById usage for reset; instead, use a local ref to the input so each instance resets its own input reliably when import completes. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}