{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Downloadable sample CSV templates and dashboard-accessible “How to use this platform” guide",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Add sample CSV templates as static public assets downloadable without backend calls",
      "acceptanceCriteria": [
        "The following files exist under a public static path (e.g., frontend/public/assets/samples/) and are served by the frontend without requiring backend calls: trade-import-sample.csv, bank-reconciliation-sample.csv, client-bulk-upload-sample.csv, margin-snapshot-sample.csv",
        "Each CSV file content matches the sample formats previously provided (headers + at least two example rows).",
        "Directly visiting each file URL in the browser downloads/displays the CSV successfully (HTTP 200)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/samples/trade-import-sample.csv",
          "operation": "create",
          "description": "Create the Trade Import sample CSV as a static asset with the provided header format and at least two example rows so it can be downloaded directly (no backend capability)."
        },
        {
          "path": "frontend/public/assets/samples/bank-reconciliation-sample.csv",
          "operation": "create",
          "description": "Create the Bank Reconciliation sample CSV as a static asset with the provided header format and at least two example rows so it can be downloaded directly (no backend capability)."
        },
        {
          "path": "frontend/public/assets/samples/client-bulk-upload-sample.csv",
          "operation": "create",
          "description": "Create the Client Bulk Upload sample CSV as a static asset with the provided header format and at least two example rows so it can be downloaded directly (no backend capability)."
        },
        {
          "path": "frontend/public/assets/samples/margin-snapshot-sample.csv",
          "operation": "create",
          "description": "Create the Margin Snapshot sample CSV as a static asset with the provided header format and at least two example rows so it can be downloaded directly (no backend capability)."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add “Download sample file” links/buttons on each relevant module page pointing to the static CSV assets",
      "acceptanceCriteria": [
        "Trade Import page (frontend/src/pages/data-entry/TradeImportPage.tsx) includes a clearly labeled download link/button for the Trade Import sample CSV that points to the static asset URL.",
        "Bank Reconciliation page (frontend/src/pages/reconciliation/BankReconciliationPage.tsx) includes a clearly labeled download link/button for the Bank Reconciliation sample CSV that points to the static asset URL.",
        "Client Management page (frontend/src/pages/clients/ClientManagementPage.tsx) includes a clearly labeled download link/button for the Client Bulk Upload sample CSV that points to the static asset URL.",
        "Margin & Collateral page (frontend/src/pages/margin/MarginCollateralPage.tsx) includes a clearly labeled download link/button for the Margin Snapshot sample CSV that points to the static asset URL.",
        "All download links use English user-facing text and do not require any special permissions beyond being logged in (i.e., visible to authenticated users who can view the page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/data-entry/TradeImportPage.tsx",
          "operation": "modify",
          "description": "Expose a clearly labeled “Download sample file” UI control near the upload area that links to the static asset at frontend/public/assets/samples/trade-import-sample.csv. Use existing shadcn-ui primitives already used on the page (e.g., Card/Button/Tabs) to keep styling consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/reconciliation/BankReconciliationPage.tsx",
          "operation": "modify",
          "description": "Expose a clearly labeled “Download sample file” UI control on the page (not permission-gated beyond being logged in) that links to frontend/public/assets/samples/bank-reconciliation-sample.csv. Use existing shadcn-ui primitives already used on the page (e.g., Card/Button). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/clients/ClientManagementPage.tsx",
          "operation": "modify",
          "description": "Expose a clearly labeled “Download sample file” UI control for bulk client upload that links to frontend/public/assets/samples/client-bulk-upload-sample.csv. Place it in a discoverable location (e.g., page header area near primary actions) and keep it visible for authenticated users who can view the page. Use existing shadcn-ui primitives already used on the page (e.g., Button/Card). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/margin/MarginCollateralPage.tsx",
          "operation": "modify",
          "description": "Expose a clearly labeled “Download sample file” UI control that links to frontend/public/assets/samples/margin-snapshot-sample.csv, placed near the Margin Snapshots context. Use existing shadcn-ui primitives already used on the page (e.g., Card/Tabs/Button). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add a reader-friendly “How to use this platform” guide page and link to it prominently from the dashboard overview",
      "acceptanceCriteria": [
        "A new guide view/page exists that presents a structured, reader-friendly “How to use this platform” guide in English with headings and sections suitable for scanning (e.g., Getting Started, Roles & Permissions, Trade Import, Clients, Margin, Reconciliation, Reports, Calendar, Surveillance, Audit Trail, Configuration, Troubleshooting/FAQ).",
        "The guide is reachable from the dashboard (frontend/src/pages/OverviewPage.tsx) via a clearly labeled card/section and button/link (e.g., “How to use this platform”).",
        "Navigation to the guide does not break existing routes and works with the current TanStack Router setup (frontend/src/App.tsx).",
        "The guide content is readable on both desktop and smaller screens (reasonable typography, spacing, and scroll behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HowToUseGuidePage.tsx",
          "operation": "create",
          "description": "Create a dedicated guide page that renders a structured English “How to use this platform” document with scannable headings/sections (Getting Started, Roles & Permissions, Trade Import, Clients, Margin, Reconciliation, Reports, Calendar, Surveillance, Audit Trail, Configuration, Troubleshooting/FAQ) using existing layout patterns and shadcn-ui primitives (e.g., Card) for consistent typography and spacing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for the guide page (e.g., a path like /how-to-use) and ensure it renders within the existing authenticated DashboardLayout + Outlet route tree without breaking current routes."
        },
        {
          "path": "frontend/src/pages/OverviewPage.tsx",
          "operation": "modify",
          "description": "Add a prominent “How to use this platform” card/section on the dashboard overview with a clear button/link that navigates to the new guide route. Use existing shadcn-ui primitives already used on the page (Card/Button) for consistent styling and responsive readability. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}