{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend support for bootstrap admin role visibility and capability gating",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the bootstrap admin user (email sanjeev.vohra@gmail.com) reliably sees Super Admin capabilities in the UI after profile save, refresh, or manual refetch, enabling PermissionGate-gated admin modules.",
      "acceptanceCriteria": [
        "When signed in and the user profile email is exactly sanjeev.vohra@gmail.com (ignoring leading/trailing spaces and case), backend checks that depend on `AccessControl.isAdmin(accessControlState, caller)` succeed for that user.",
        "After saving a profile with email sanjeev.vohra@gmail.com, a subsequent `getCallerUserProfile()` returns a profile whose `extendedRole` is \"Super Admin\" (even if the user attempted to save a different role).",
        "If a profile for the principal already exists in state with email sanjeev.vohra@gmail.com, the backend still enforces admin privileges and corrects `extendedRole` to \"Super Admin\" without requiring manual intervention.",
        "In the frontend, the sanjeev.vohra@gmail.com user can access UI areas gated by `PermissionGate capability=\"manage_users\"` (e.g., User Management page) and modules that require admin capabilities, after a refresh or refetch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "After saving the caller profile, explicitly refetch/refresh the current user profile query so any backend-enforced override to extendedRole (e.g., forcing \"Super Admin\" for the bootstrap admin email) is reflected immediately and the dialog closes without requiring a full page reload. Keep user-facing text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/layout/DashboardLayout.tsx",
          "operation": "modify",
          "description": "Add a user-menu action to refetch or invalidate the current user profile query (and thus recompute capabilities/visible modules) so the bootstrap admin can trigger a manual refresh to pick up server-corrected \"Super Admin\" role and unlock PermissionGate-gated areas like User Management. Use the existing authorization capability system (e.g., PermissionGate + capability mapping) and do not modify any files under the forbidden hooks/UI paths. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/usePermissions.ts",
          "operation": "modify",
          "description": "Ensure permission derivation updates promptly when the current user profile query changes (refetch/invalidate), so role changes to \"Super Admin\" immediately enable capabilities such as manage_users/manage_config throughout the UI. Keep logic composed around existing role normalization and capability mapping. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}