{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Trade Import: Manual trade entry UI (session-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace Manual Entry empty state with a responsive manual trade entry form collecting the required trade fields.",
      "acceptanceCriteria": [
        "On `frontend/src/pages/data-entry/TradeImportPage.tsx`, the Manual Entry tab renders a form (not an EmptyState) with labeled inputs for: client_code, trade_date, exchange, segment, security, side, quantity, price, order_id, trade_id.",
        "All user-facing labels, helper text, and button text in the manual entry UI are in English.",
        "The Manual Entry form layout is responsive and consistent with existing UI patterns (Card, form spacing, Tailwind utilities, shadcn components)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/data-entry/components/ManualTradeEntryPanel.tsx",
          "operation": "create",
          "description": "Create a Manual Entry panel component rendering a Card-based form with labeled inputs for: client_code, trade_date, exchange, segment, security, side, quantity, price, order_id, trade_id. Use the shadcn-ui component set (e.g., Card, Button, Input, Label, Select) to match existing UI patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/data-entry/TradeImportPage.tsx",
          "operation": "modify",
          "description": "Replace the Manual Entry tab EmptyState with the new ManualTradeEntryPanel component and keep layout consistent with the existing tab structure and Tailwind spacing. Use shadcn-ui Tabs/Card composition patterns already present in the file. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add client-side validation with inline error messages for manual trade entry fields.",
      "acceptanceCriteria": [
        "Attempting to submit/add a manual trade with missing required fields shows inline validation errors and does not proceed.",
        "Numeric fields (quantity, price) validate as positive numbers and show an inline error when invalid.",
        "trade_date validates as a date input and shows an inline error when invalid or missing.",
        "side validates against an explicit allowed set (e.g., Buy/Sell) and shows an inline error when not selected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/data-entry/tradeImport/manualTradeValidation.ts",
          "operation": "create",
          "description": "Add lightweight validation helpers/types for the manual trade draft: required-field checks, positive-number validation for quantity/price, date validation for trade_date, and allowed-set validation for side (e.g., Buy/Sell). Keep this frontend-only and reusable by the Manual Entry panel."
        },
        {
          "path": "frontend/src/pages/data-entry/components/ManualTradeEntryPanel.tsx",
          "operation": "modify",
          "description": "Wire validation into the form submit flow: block add when invalid, show field-level inline error text under each control, and ensure side uses an explicit allowed set. Use shadcn-ui form primitives (Input/Label/Select) and consistent Tailwind error styling (e.g., text-destructive). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Allow adding validated manual trades to an in-page, session-only list with ability to remove entries.",
      "acceptanceCriteria": [
        "After a successful form submission, the entered trade is added to a list/table shown within the Manual Entry tab and the form is reset to blank/defaults.",
        "The in-page list/table displays at least the same fields collected by the form.",
        "Each listed trade entry can be removed from the list via a delete/remove action.",
        "The list/table state is session-only (no backend persistence required for this change)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/data-entry/components/ManualTradeEntryPanel.tsx",
          "operation": "modify",
          "description": "Implement session-only state for a list of entered trades within the Manual Entry panel, append on successful validation, reset the form after add, and render a responsive table/list showing all captured fields with a per-row remove action (e.g., Button). Prefer existing Tailwind table utilities (e.g., table-dense) and shadcn-ui Buttons for actions. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Show a non-blocking informational note that manual entry is UI-prepared and not persisted to the backend.",
      "acceptanceCriteria": [
        "The Manual Entry tab includes a concise informational note (English) describing the current behavior (e.g., entries are kept in-page for now).",
        "The note is visually styled as an informational callout/alert consistent with the app’s design system.",
        "The note does not block form usage and does not appear on other tabs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/data-entry/components/ManualTradeEntryPanel.tsx",
          "operation": "modify",
          "description": "Add an informational callout at the top of the Manual Entry panel stating entries are stored in-page for the current session and not yet saved to the backend. Use the shadcn-ui Alert component (info/neutral styling) consistent with existing design patterns and ensure it only renders within the Manual Entry tab. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}