{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Role-based web app where a bootstrap admin is determined by saved profile email; compliance officer needs admin rights to upload a margin file.",
  "architectural_notes": [
    "Admin/super-admin access is granted based on an exact match between the saved user profile email and the configured bootstrap admin email; if the profile isn't saved/updated to that email, the user is treated as a normal user."
  ],
  "known_issues": [
    "Users may not receive admin rights if their profile email was never saved or was saved with a different email than the configured admin email (requires profile update/resave)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-show-an-obvious-persistent-warning-in-the-authenticated-ui-when-the-logged-in-user-s-saved-profile-email-does-not-match-the-configured-bootstrap-admin-email-sanjeev-vohra-gmail-com-explaining-that-admin-rights-will-not-be-granted-until-the-profile-email-is-updated-and-saved",
      "title": "Show an obvious, persistent warning in the authenticated UI when the logged-in user's saved profile email does not match the configured bootstrap admin email \"sanjeev.vohra@gmail.com\", explaining that admin rights will not be granted until the profile email is updated and saved.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-an-inline-hint-validation-message-in-the-profile-setup-dialog-that-alerts-the-user-when-they-type-an-email-other-than-sanjeev-vohra-gmail-com-that-they-will-not-receive-super-admin-access-unless-they-use-the-admin-email",
      "title": "Add an inline hint/validation message in the Profile Setup dialog that alerts the user when they type an email other than \"sanjeev.vohra@gmail.com\" that they will not receive Super Admin access unless they use the admin email.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add UI warning/banner when the logged-in user's saved profile email does not match the configured admin email, indicating admin rights will not be granted.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Add admin-email mismatch warning banner for bootstrap admin account",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}